app/controllers/companies_controller.rb

SELECT * FROM `companies` WHERE (companies.country_id =15)
SELECT * FROM `companies`
SELECT * FROM `countries`
SELECT * FROM `companies` WHERE (`companies`.`id` = '15')
SELECT * FROM `countries` WHERE (`countries`.`id` = 15)
SELECT * FROM `states` WHERE (`states`.`id` = 19)
---
  def index
  	if params[:location] && params[:location].size == 3
			@companies = Company.find_by_country(params[:location])
			@companies.size == 0 ? flash[:error] = "No se encontraron compañías en ese país" : @companies
	  elsif params[:location] && params[:location].size == 2
			@companies = Company.find_by_state(params[:location])
			@companies.size == 0 ? flash[:error] = "No se encontraron compañías en ese estado" : @companies
	  else
	  	@companies = Company.find(:all)

SELECT * FROM `companies` WHERE (`companies`.`id` = 5)
---
  def show
    @company = Company.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def new
    @user = User.find(params[:user_id])

SELECT * FROM `users` WHERE (`users`.`id` = 1)
INSERT INTO `companies` (`name`, `price`, `city`, `country_id`, `user_id`, `phone`, `description`, `state_id`) VALUES('Administradores Cienfuegos', '12231', 'Monterrey', NULL, 1, '1234567890', 'Administración on fire!', NULL)
---
  def create
  	@user = User.find(params[:user_id])
  	@company = @user.companies.build(params[:company])
    if @company.save

SELECT * FROM `companies` WHERE (`companies`.`id` = 5)
---
  def edit
    @company = Company.find(params[:id])

SELECT * FROM `companies` WHERE ((companies.name LIKE '%Yeah%') AND (companies.country_id = 1))
---
  def search
  	@searchlogic = Company.searchlogic(params[:search])
  	@companies = @searchlogic.all