app/controllers/experiences_controller.rb

SELECT * FROM `experiences`
---
  def index
    @experiences = Experience.all