app/controllers/experiences_controller.rb

  def show
    @experience = @company.experiences.find(params[:id])
---
SELECT * FROM `experiences` WHERE (`experiences`.`id` = 1)

  def new
  	@experience = @company.experiences.find(params[:company_id]).experiences.build
---
SELECT * FROM `experiences` WHERE (`experiences`.`id` = 1 AND (`experiences`.company_id = 1))

  def create
  	@experience = @company.experiences.build(params[:experience])
#    @experience = Experience.new(params[:experience])
    if @experience.save
---
INSERT INTO `experiences` (`name`, `end_year`, `company_id`, `description`, `start_year`) VALUES('Mi Casa', '2011', 5, 'Administro mi casa', '2008')

  def find_company
    @company = Company.find(params[:company_id])
---
SELECT * FROM `companies` WHERE (`companies`.`id` = 10)