app/controllers/tools_controller.rb

  def index
    @tools = Tool.all
---
SELECT * FROM `tools`

  def show
    @tool = @company.tools.find(params[:id])
---
SELECT * FROM `tools` WHERE (`tools`.`id` = 1)

  def create
   	@tool = @company.tools.build(params[:tool])
    if @tool.save
---
INSERT INTO `tools` (`name`, `company_id`, `description`) VALUES('Seguridad', 5, 'Siempre Seguros')

  def find_company
    @company = Company.find(params[:company_id])
---
SELECT * FROM `companies` WHERE (`companies`.`id` = 5)