app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `salt`, `created_at`, `activated_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `activation_code`, `remember_token`, `email`) VALUES('René Cienfuegos', '9e280f58a26420f1e379367e913f416ebf52d78c', '2009-12-10 21:59:53', NULL, '43423cd7e7e6c31ff558a8624cba1c31d873239d', NULL, '2009-12-10 21:59:53', 'f8d1a6e3ad672a5495319e5880edc6f1055c2dfd', NULL, 'rene@innku.com')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save